khoih-prog/Blynk_Esp8266AT_WM/src/BlynkSimpleShieldEsp8266_DUE_WM.h
              if (connect())
              {
                BLYNK_LOG1(BLYNK_F("r:W+BOK"));
              }
            }
          }
          else
          {
            BLYNK_LOG1(BLYNK_F("r:Blost.TryB"));
            if (connect())
            {
              BLYNK_LOG1(BLYNK_F("r:BOK"));
            }
          }

          //BLYNK_LOG1(BLYNK_F("run: Lost connection => configMode"));
          //startConfigurationMode();
        }
      }
      else if (configuration_mode)
      {
        configuration_mode = false;
        BLYNK_LOG1(BLYNK_F("r:gotW+Bback"));
      }

      if (connected())
      {
        Base::run();
      }
    }

    void setConfigPortalIP(IPAddress portalIP = IPAddress(192, 168, 4, 1))
    {
      portal_apIP = portalIP;
    }

    void setConfigPortal(String ssid = "", String pass = "")
    {
      portal_ssid = ssid;
      portal_pass = pass;
    }

    void setSTAStaticIPConfig(IPAddress ip, IPAddress gw, IPAddress sn = IPAddress(255, 255, 255, 0),
                              IPAddress dns_address_1 = IPAddress(0, 0, 0, 0),
                              IPAddress dns_address_2 = IPAddress(0, 0, 0, 0))
    {
      static_IP     = ip;
      static_GW     = gw;
      static_SN     = sn;

      // Default to local GW
      if (dns_address_1 == IPAddress(0, 0, 0, 0))
        static_DNS1   = gw;
      else
        static_DNS1   = dns_address_1;

      // Default to Google DNS (8, 8, 8, 8)
      if (dns_address_2 == IPAddress(0, 0, 0, 0))
        static_DNS2   = IPAddress(8, 8, 8, 8);
      else
        static_DNS2   = dns_address_2;
    }

    String getServerName()
    {
      if (!hadConfigData)
        getConfigData();

      return (String(Blynk8266_WM_config.blynk_server));
    }

    String getToken()
    {
      if (!hadConfigData)
        getConfigData();

      return (String(Blynk8266_WM_config.blynk_token));
    }

    String getBoardName()
    {
      if (!hadConfigData)
        getConfigData();

      return (String(Blynk8266_WM_config.board_name));
    }

    int getHWPort()
    {
      if (!hadConfigData)
        getConfigData();

      return (Blynk8266_WM_config.blynk_port);
    }

    Blynk_WF_Configuration* getFullConfigData(Blynk_WF_Configuration *configData)
    {
      if (!hadConfigData)
        getConfigData();

      // Check if NULL pointer
      if (configData)
        memcpy(configData, &Blynk8266_WM_config, sizeof(Blynk_WF_Configuration));

      return (configData);
    }

    String getLocalIP(void)
    {
      uint16_t indexNextLine;

      ipAddress = wifi->getLocalIP();
      ipAddress.replace("+CIFSR:STAIP,\"", "");
      ipAddress.replace("\"", "");
      indexNextLine = ipAddress.indexOf("\n");
      ipAddress = ipAddress.substring(0, indexNextLine);

      //BLYNK_LOG2(BLYNK_F("getLocalIP: IP = "), ipAddress);
      return ipAddress;
    }

    void clearConfigData()
    {
      memset(&Blynk8266_WM_config, 0, sizeof(Blynk8266_WM_config));
      //EEPROM.put(EEPROM_START, BlynkEthernet_WM_config);
      dueFlashStorage.write(EEPROM_START, (byte *) &Blynk8266_WM_config, sizeof(Blynk8266_WM_config));
    }

    void resetFunc()
    {
      BlynkReset();
    }

  private:
    ESP8266* wifi;
    String ipAddress = "0.0.0.0";

    ESP8266_AT_WebServer* server;
    bool configuration_mode = false;

    unsigned long configTimeout;
    bool hadConfigData = false;

    Blynk_WF_Configuration Blynk8266_WM_config;

    String macAddress = "";
    bool wifi_connected = false;

    // For Config Portal, from Blynk_WM v1.0.5
    IPAddress portal_apIP = IPAddress(192, 168, 4, 1);

    String portal_ssid = "";
    String portal_pass = "";

    // For static IP, from Blynk_WM v1.0.5
    IPAddress static_IP   = IPAddress(0, 0, 0, 0);
    IPAddress static_GW   = IPAddress(0, 0, 0, 0);
    IPAddress static_SN   = IPAddress(255, 255, 255, 0);
    IPAddress static_DNS1 = IPAddress(0, 0, 0, 0);
    IPAddress static_DNS2 = IPAddress(0, 0, 0, 0);

    void displayConfigData(void)
    {
      BLYNK_LOG6(BLYNK_F("Hdr="),  Blynk8266_WM_config.header, BLYNK_F(",SSID="), Blynk8266_WM_config.wifi_ssid,
                 BLYNK_F(",PW="),  Blynk8266_WM_config.wifi_pw);
      BLYNK_LOG6(BLYNK_F("Svr="),  Blynk8266_WM_config.blynk_server, BLYNK_F(",Prt="), Blynk8266_WM_config.blynk_port,
                 BLYNK_F(",Tok="), Blynk8266_WM_config.blynk_token);
      BLYNK_LOG2(BLYNK_F("Board Name = "), Blynk8266_WM_config.board_name);
    }

    void displayWiFiData(void)
    {
      BLYNK_LOG2(BLYNK_F("IP="), getLocalIP());
    }


#define BLYNK_BOARD_TYPE   "SHD_ESP8266"
#define NO_CONFIG           "nothing"


    int calcChecksum()
    {
      int checkSum = 0;
      for (uint16_t index = 0; index < (sizeof(Blynk8266_WM_config) - sizeof(Blynk8266_WM_config.checkSum)); index++)
      {
        checkSum += * ( ( (byte*) &Blynk8266_WM_config ) + index);
      }

      return checkSum;
    }

    bool getConfigData()
    {
      //EEPROM.get(EEPROM_START, Blynk8266_WM_config);
      hadConfigData = false;

      Blynk_WF_Configuration* dataPointer = (Blynk_WF_Configuration* ) dueFlashStorage.readAddress(EEPROM_START);
      memcpy(&Blynk8266_WM_config, dataPointer, sizeof(Blynk8266_WM_config));

      int calChecksum = calcChecksum();

      BLYNK_LOG4(BLYNK_F("CCSum="), calChecksum, BLYNK_F(",RCSum="), Blynk8266_WM_config.checkSum);

      if ( (strncmp(Blynk8266_WM_config.header, BLYNK_BOARD_TYPE, strlen(BLYNK_BOARD_TYPE)) != 0) ||
           (calChecksum != Blynk8266_WM_config.checkSum) )
      {
        memset(&Blynk8266_WM_config, 0, sizeof(Blynk8266_WM_config));

        //EEPROM.put(EEPROM_START, Blynk8266_WM_config);

        //BLYNK_LOG2(BLYNK_F("Init new EEPROM, size = "), EEPROM.length());
        BLYNK_LOG2(BLYNK_F("WriteData2Flash,sz="), sizeof(Blynk8266_WM_config));

        // doesn't have any configuration
        strcpy(Blynk8266_WM_config.header,           BLYNK_BOARD_TYPE);
        strcpy(Blynk8266_WM_config.wifi_ssid,        NO_CONFIG);
        strcpy(Blynk8266_WM_config.wifi_pw,          NO_CONFIG);
        strcpy(Blynk8266_WM_config.blynk_server,     NO_CONFIG);
        Blynk8266_WM_config.blynk_port = BLYNK_SERVER_HARDWARE_PORT;
        strcpy(Blynk8266_WM_config.blynk_token,      NO_CONFIG);
        strcpy(Blynk8266_WM_config.board_name,       NO_CONFIG);
        // Don't need
        Blynk8266_WM_config.checkSum = 0;

